---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.NumericRevisionSettings
source: html/3e7a7a13-5c18-10bc-5bdb-697bcfa916cf.htm
---
# NumericRevisionSettings Members

Constructs a NumericRevisionSettings with a simple, default numbering sequence.